Lora-net/LoRaMac-node/src/boards/mcu/nRF52/SDK/external/nfc_adafruit_library/adafruit_pn532.c
    if (force)
    {
        NRF_LOG_INFO("Forcing library reinitialization\r\n");
    }

    if (m_pn532_object.using_spi)
    {
        NRF_LOG_INFO("Communication over SPI is currently not supported!\r\n");
        return NRF_ERROR_INTERNAL;
    }

    ret_code_t err_code = adafruit_pn532_i2c_create();
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to create I2C, err_code = %d\r\n", err_code);
        return err_code;
    }

    adafruit_pn532_pin_setup();

    // Delay for PN532 to catch up with NRF.
    nrf_delay_ms(100);

    NRF_LOG_INFO("Looking for PN532\r\n");

    err_code = adafruit_pn532_firmware_version_get(&ver_data);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Didn't find PN53x board, err_code = %d\r\n", err_code);
        return err_code;
    }

    NRF_LOG_INFO("Found chip PN5%02x\r\n", (ver_data >> 24) & 0xFF);
    NRF_LOG_INFO("Firmware version %d.%d\r\n", (ver_data >> 16) & 0xFF,
                                               (ver_data >> 8)  & 0xFF);

    err_code = adafruit_pn532_sam_config(SAMCONFIGURATION_MODE_NORMAL);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to configure SAM, err_code = %d\r\n", err_code);
        return err_code;
    }

    err_code = adafruit_pn532_passive_activation_retries_set(0xFF);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to set passive activation retries, err_code = %d\r\n", err_code);
        return err_code;
    }

    NRF_LOG_INFO("Waiting for an ISO14443A card\r\n");

    m_lib_initialized = true;

    return NRF_SUCCESS;
}


ret_code_t adafruit_pn532_i2c_create(void)
{
    NRF_LOG_INFO("Creating I2C\r\n");

    nrf_drv_twi_config_t twi_config = NRF_DRV_TWI_DEFAULT_CONFIG;
    twi_config.scl = PN532_CONFIG_SCL;
    twi_config.sda = PN532_CONFIG_SDA;

    ret_code_t ret = nrf_drv_twi_init(&m_twi_master, &twi_config, NULL, NULL);
    if (ret != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to initialize TWI, err_code = %d\r\n", ret);
        return ret;
    }

    nrf_drv_twi_enable(&m_twi_master);

    return NRF_SUCCESS;
}


void adafruit_pn532_tag_info_printout(nfc_a_tag_info const * const p_tag_info)
{
    NRF_LOG_INFO("Basic NFC-A Tag information\r\n");
    NRF_LOG_INFO("Anticollision information byte of SENS_RES: 0x%02X\r\n",
                 p_tag_info->sens_res[SENS_RES_ANTICOLLISION_INFO_BYTE]);
    NRF_LOG_INFO("Platform information byte of SENS_RES: 0x%02X\r\n",
                 p_tag_info->sens_res[SENS_RES_PLATFORM_INFO_BYTE]);
    NRF_LOG_INFO("SEL_RES: 0x%02X\r\n", p_tag_info->sel_res);
    NRF_LOG_INFO("%d-byte NFC ID:\r\n", p_tag_info->nfc_id_len);
    NRF_LOG_HEXDUMP_INFO(p_tag_info->nfc_id, p_tag_info->nfc_id_len);
    NRF_LOG_RAW_INFO("\r\n");
}


ret_code_t adafruit_pn532_firmware_version_get(uint32_t * p_response)
{
    NRF_LOG_INFO("Trying to get the firmware version\r\n");

    m_pn532_packet_buf[0] = PN532_COMMAND_GETFIRMWAREVERSION;

    ret_code_t err_code = adafruit_pn532_cmd_send(m_pn532_packet_buf,
                                                  COMMAND_GETFIRMWAREVERSION_LENGTH,
                                                  1000);

    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to send GetFirmwareVersion command, err_code = %d\r\n", err_code);
        return err_code;
    }

    // Read data packet.
    err_code = adafruit_pn532_data_read(m_pn532_packet_buf, REPLY_GETFIRMWAREVERSION_LENGTH);

    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to read data, err_code = %d\r\n", err_code);
        return err_code;
    }

    if (memcmp(m_pn532_packet_buf + 1, m_pn532_rsp_firmware_ver, sizeof(m_pn532_rsp_firmware_ver)))
    {
        NRF_LOG_INFO("Firmware frame doesn't match!\r\n");
        return NRF_ERROR_NOT_FOUND;
    }

    // Extract firmware version from the frame.
    *p_response = uint32_big_decode(m_pn532_packet_buf + PN532_DATA_OFFSET + 1);

    return NRF_SUCCESS;
}


ret_code_t adafruit_pn532_cmd_send(uint8_t * p_cmd, uint8_t cmd_len, uint16_t timeout)
{
    NRF_LOG_INFO("Trying to send command\r\n");
    NRF_LOG_HEXDUMP_INFO(p_cmd, cmd_len);

    ret_code_t err_code = adafruit_pn532_command_write(p_cmd, cmd_len);

    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed to write command, err_code = %d\r\n", err_code);
        return err_code;
    }

    // Wait for ACK
    if (!adafruit_pn532_waitready_ms(timeout))
    {
        NRF_LOG_INFO("Failed while waiting\r\n");
        return NRF_ERROR_INTERNAL;
    }

    return adafruit_pn532_ack_read();
}


ret_code_t adafruit_pn532_sam_config(uint8_t mode)
{
    NRF_LOG_INFO("Attempting to configure SAM\r\n");

    ret_code_t err_code;

    if ( (mode != SAMCONFIGURATION_MODE_NORMAL) &&
         (mode != SAMCONFIGURATION_MODE_VIRTUAL_CARD) &&
         (mode != SAMCONFIGURATION_MODE_WIRED_CARD) &&
         (mode != SAMCONFIGURATION_MODE_DUAL_CARD) )
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    m_pn532_packet_buf[0] = PN532_COMMAND_SAMCONFIGURATION;
    m_pn532_packet_buf[1] = mode;
    m_pn532_packet_buf[2] = 0x14; // Time-out value
    m_pn532_packet_buf[3] = SAMCONFIGURATION_IRQ_ENABLED;

    err_code = adafruit_pn532_cmd_send(m_pn532_packet_buf, COMMAND_SAMCONFIGURATION_LENGTH, 1000);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed while checking ACK! err_code = %d\r\n", err_code);
        return err_code;
    }

    err_code = adafruit_pn532_data_read(m_pn532_packet_buf, REPLY_SAMCONFIGURATION_LENGTH);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("Failed while reading data! err_code = %d\r\n", err_code);
        return err_code;
    }

    if (!(m_pn532_packet_buf[PN532_DATA_OFFSET] == PN532_COMMAND_SAMCONFIGURATION + 1))
    {
        NRF_LOG_INFO("Failed while checking SAMCONFIGURATION response, expected 0x%02x, got 0x%02x\r\n",
                     PN532_COMMAND_SAMCONFIGURATION + 1,
                     m_pn532_packet_buf[PN532_DATA_OFFSET]);
        return NRF_ERROR_NOT_FOUND;
    }

    return NRF_SUCCESS;
}


ret_code_t adafruit_pn532_power_down(void)
{
    NRF_LOG_INFO("Powering down the PN532\r\n");

